{"scoring":"В данной задаче ровно 100 тестов:\r\n\\begin{enumerate}\r\n\\item В тестах \\texttt{1-6}: $N = 1$ или $M = 1$.\r\n\\item В тестах \\texttt{7-16}: $1 \\leq N,M \\leq 20$.\r\n\\item В тестах \\texttt{17-26}: $1 \\leq N,M \\leq 100$.\r\n\\item В тестах \\texttt{27-36}: $1 \\leq N,M \\leq 450$.\r\n\\item В тестах \\texttt{37-100}: $1 \\leq N,M \\leq 2500$.\r\n\\end{enumerate}\r\n\r\nЗа каждый пройденный тест участник получает $1$ балл.","notes":"В тестовом примере размер оптимального прямоугольника равен $3 \\times 1$.","legend":"Земляне и инопланетяне ведут бой за Марс. Бой идет на прямоугольном клеточном поле размером $N \\times M$. Каждая клетка полностью принадлежит одной из сторон. Земляне могут создать бомбу, поражающую каждую клетку некой прямоугольной области на поле боя, стороны которых параллельны сторонам поле боя. Бомбу нельзя поворачивать и использовать за пределами поля боя. Бомбу можно использовать неограниченное количество раз. Естественно, земляне не хотят, чтобы бомба попала на свои клетки, но они могут создать бомбу только одного определенного размера. Вычислите максимальную площадь поражения (т.е. произведению высоты и ширины) бомбы, используя которую можно поразить все клетки инопланетян, а клетки Землян останутся целыми. Любую клетку инопланетян можно поразить многократно.","authorLogin":"gamzaza","language":"russian","timeLimit":1000,"output":"Выведите одно число - площадь области поражения бомбы.","inputFile":"bomb.in","outputFile":"bomb.out","input":"В первой строке находятся два целых числа $N$, $M$ ($1 \\leq N,M \\leq 2\\,500$), разделенных пробелом, где $N$ и $M$ — соответственно высота и ширина поля боя. Далее следуют $N$ строк по $M$ символов каждая, задающие поле боя. Если символ в строке равен «0», то соответствующая клетка принадлежит Землянам, а если он равен «1», то эта клетка принадлежит инопланетянам.","authorName":"zaa gamezardashvili","sampleTests":[{"output":"3\r\n","input":"5 6\r\n001000\r\n111110\r\n111110\r\n111110\r\n000100\r\n"}],"name":"Бомба","interaction":null,"memoryLimit":134217728,"tutorial":""}