{"scoring":"This problem consists of 3 subtasks:\r\n\\begin{enumerate}\r\n\\item $1 \\leq N, M \\leq 1\\,000$. Score $22$ points.\r\n\\item $1 \\leq N, M \\leq 100\\,000$. Only query (second type) operations are allowed. Score $27$ points.\r\n\\item $1 \\leq N, M \\leq 100\\,000$. Score $51$ points.\r\n\\end{enumerate}\r\n\r\nEach subtask will be scored only if the solution successfully passes all of the previous subtasks.","notes":"","legend":"NurlashKO was well behaved during last year, for this Ded Moroz gifted him for New Year polygonal chain line with $N$ vertices. $i$-th vertex of this chain located at the point with coordinates $(i, y_i)$.\r\n\r\nVery soon a new game with this geometric figure was invented: the following operations are executed $M$ times: \r\n\\begin{itemize}  \r\n   \\item Change $y$ coordinate for one of the chain vertexes.\r\n   \\item Draw a horizontal line at the height $H$ and count its intersections with the chain. Note, that all points of horizontal line have $y$ coordinate equal to $H$.\r\n\\end{itemize}\r\n\r\nNurlashKO likes this game and he asks your help to write a program for this game.\r\n","authorLogin":"NurlashKO","language":"english","timeLimit":1000,"output":"For each query of the second type on a separate line output the number of intersections of horizontal line with the chain. Output answers to queries in the same order as they appear in the input file.\r\n","inputFile":"game.in","outputFile":"game.out","input":"First line of input contains two positive integers $N, M (1 \\leq N, M \\leq 100\\,000)$~--- the numbers of vertices and operations in the game, respectively.\r\n\r\nNext line contains $N$ positive integers separated by a single space $h_i (1 \\leq h_i \\leq 1\\,000\\,000)$~--- $h_i$ is the original height of the $i$-th vertex.\r\n\r\nThen in $M$ lines follows descriptions of the game operations in the following format:\r\n\\begin{itemize}\r\n\\item $1$ $pos$ $val$ $(1 \\leq pos \\leq N, 1 \\leq val \\leq 1\\,000\\,000)$~--- vertex number and its new new height, respectively.\r\n\\item $2$ $H$ $(1 \\leq H \\leq 1\\,000\\,000)$~--- height of the horizontal line. It is guaranteed that this line will never intersects with the chain at the vertices.\r\n\\end{itemize}","authorName":"Nurlan Zhusupov","sampleTests":[{"output":"2\r\n1\r\n","input":"3 3\r\n1 5 1\r\n2 3\r\n1 1 5\r\n2 3\r\n"}],"name":"Simple game","interaction":null,"memoryLimit":268435456,"tutorial":""}